package org.example.project.screens.sportsman

import org.example.project.domain.model.sportsman.SportsmanUI

data class SportsmanState(
    val search: String,
    val sportsmans: List<SportsmanUI>
) {
    companion object {
        val InitState = SportsmanState(
            "", listOf(
                SportsmanUI("1", "10", "Алексей", "Иванов", "Сергеевич", 28, 180, 75),
                SportsmanUI("2", "12", "Иван", "Петров", "Дмитриевич", 25, 176, 80),
                SportsmanUI("3", "15", "Мария", "Смирнова", "Александровна", 22, 170, 60),
                SportsmanUI("4", "23", "Екатерина", "Васильева", "Михайловна", 26, 165, 55),
                SportsmanUI("5", "30", "Дмитрий", "Кузнецов", "Николаевич", 29, 185, 85),
                SportsmanUI("6", "32", "Андрей", "Новиков", "Петрович", 27, 178, 77),
                SportsmanUI("7", "45", "Ольга", "Соколова", "Владимировна", 24, 172, 58),
                SportsmanUI("8", "50", "Сергей", "Морозов", "Анатольевич", 31, 182, 90),
                SportsmanUI("9", "51", "Татьяна", "Лебедева", "Игоревна", 23, 160, 52),
                SportsmanUI("10", "62", "Павел", "Горбунов", "Вячеславович", 30, 189, 92),
                SportsmanUI("11", "73", "Никита", "Федоров", "Артурович", 26, 177, 78),
                SportsmanUI("12", "84", "Ирина", "Коваленко", "Юрьевна", 21, 168, 63),
                SportsmanUI("13", "95", "Максим", "Ермаков", "Павлович", 33, 183, 88),
                SportsmanUI("14", "102", "Анастасия", "Гончарова", "Романовна", 28, 164, 59),
                SportsmanUI("15", "115", "Виктор", "Тарасов", "Федорович", 29, 181, 80),
                SportsmanUI("16", "126", "Елена", "Дмитриева", "Станиславовна", 24, 171, 61),
                SportsmanUI("17", "137", "Кирилл", "Лукашин", "Геннадьевич", 25, 180, 83),
                SportsmanUI("18", "148", "Алёна", "Попова", "Константиновна", 22, 169, 56),
                SportsmanUI("19", "150", "Артем", "Зайцев", "Иванович", 27, 175, 70),
                SportsmanUI("20", "160", "Юлия", "Шмидт", "Евгеньевна", 23, 162, 54)
            )
        )
    }
}